[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:40:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="ArticlesForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {false}
 
                 <Col>
killedBy: ArticlesForm tests renders correctly when passing in an Article
statusReason: Error: Unable to find an element by: [data-testid="/ArticlesForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Articles/ArticlesForm.js:40:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="ArticlesForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {initialContents || <Col>
+                        <Form.Group className="mb-3">
+                            <Form.Label htmlFor="id">Id</Form.Label>
+                            <Form.Control data-testid="ArticlesForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+                        </Form.Group>
+                    </Col>}
 
                 <Col>
killedBy: ArticlesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:82:49
                             id="url"
                             type="text"
                             isInvalid={Boolean(errors.url)}
-                            {...register("url", {
-                                required: "URL is required.",
-                                pattern: url_regex
-                            })}
+                            {...register("url", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /URL must be a valid address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:83:43
                             type="text"
                             isInvalid={Boolean(errors.url)}
                             {...register("url", {
-                                required: "URL is required.",
+                                required: "",
                                 pattern: url_regex
                             })}
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /URL is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:88:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.url && 'URL is required. '}
+                            {false}
                             {errors.url?.type === 'pattern' && 'URL must be a valid address (e.g. google.com, http://google.com, https://google.com)'}
                         </Form.Control.Feedback>
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /URL is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Articles/ArticlesForm.js:88:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.url && 'URL is required. '}
+                            {errors.url || 'URL is required. '}
                             {errors.url?.type === 'pattern' && 'URL must be a valid address (e.g. google.com, http://google.com, https://google.com)'}
                         </Form.Control.Feedback>
killedBy: ArticlesForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /URL/

Here are the matching elements:

<label
  class="form-label"
  for="url"
>

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:89:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.url && 'URL is required. '}
-                            {errors.url?.type === 'pattern' && 'URL must be a valid address (e.g. google.com, http://google.com, https://google.com)'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /URL must be a valid address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/Articles/ArticlesForm.js:89:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.url && 'URL is required. '}
-                            {errors.url?.type === 'pattern' && 'URL must be a valid address (e.g. google.com, http://google.com, https://google.com)'}
+                            {errors.url.type === 'pattern' && 'URL must be a valid address (e.g. google.com, http://google.com, https://google.com)'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: ArticlesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:108:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.email && 'Email is required. '}
+                            {false}
                             {errors.email?.type === 'pattern' && 'Email must be a valid address (e.g. test@gmail.com, xd@yahoo.com)'}
                         </Form.Control.Feedback>
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:108:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.email && 'Email is required. '}
+                            {true}
                             {errors.email?.type === 'pattern' && 'Email must be a valid address (e.g. test@gmail.com, xd@yahoo.com)'}
                         </Form.Control.Feedback>
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:109:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.email && 'Email is required. '}
-                            {errors.email?.type === 'pattern' && 'Email must be a valid address (e.g. test@gmail.com, xd@yahoo.com)'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Email must be a valid address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Articles/ArticlesForm.js:109:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.email && 'Email is required. '}
-                            {errors.email?.type === 'pattern' && 'Email must be a valid address (e.g. test@gmail.com, xd@yahoo.com)'}
+                            {errors.email?.type === 'pattern' || 'Email must be a valid address (e.g. test@gmail.com, xd@yahoo.com)'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: ArticlesForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Email/

Here are the matching elements:

<label
  class="form-label"
  for="email"
>

[Killed] BooleanLiteral
main/components/Articles/ArticlesForm.js:140:67
                             id="dateAdded"
                             type="datetime-local"
                             isInvalid={Boolean(errors.dateAdded)}
-                            {...register("dateAdded", { required: true, pattern: isodate_regex })}
+                            {...register("dateAdded", { required: false, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date added is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:143:30
                             {...register("dateAdded", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateAdded && 'Date added is required. '}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date added is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Articles/ArticlesForm.js:143:30
                             {...register("dateAdded", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateAdded && 'Date added is required. '}
+                            {errors.dateAdded || 'Date added is required. '}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.
