[Killed] BlockStatement
main/components/Restaurants/RestaurantTable.js:16:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/restaurants/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: RestaurantTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/restaurants/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Restaurants/RestaurantTable.js:17:18
     const navigate = useNavigate();
 
     const editCallback = (cell) => {
-        navigate(`/restaurants/edit/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: RestaurantTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/restaurants/edit/2"
Received: ""

Number of calls: 1

<html>

[Killed] BlockStatement
main/components/Restaurants/RestaurantTable.js:48:45
         }
     ];
 
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix));
-    } 
+    if (hasRole(currentUser, "ROLE_ADMIN")) {} 
 
     return <OurTable
killedBy: RestaurantTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RestaurantTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
