[Killed] ArrowFunction
main/pages/Restaurants/RestaurantCreatePage.js:9:31
 
 export default function RestaurantCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (restaurant) => ({
-    url: "/api/restaurants/post",
-    method: "POST",
-    params: {
-     name: restaurant.name,
-     description: restaurant.description
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (restaurant) => {
killedBy: RestaurantCreatePage tests on submit, makes request to backend, and redirects to /restaurants
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/Restaurants/RestaurantCreatePage.js:18:37
     }
   });
 
-  const onSuccess = (restaurant) => {
-    toast(`New restaurant Created - id: ${restaurant.id} name: ${restaurant.name}`);
-  }
+  const onSuccess = (restaurant) => {}
 
   const mutation = useBackendMutation(
killedBy: RestaurantCreatePage tests on submit, makes request to backend, and redirects to /restaurants
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New restaurant Created - id: 3 name: South Coast Deli"

Number of calls: 0

[Killed] StringLiteral
main/pages/Restaurants/RestaurantCreatePage.js:19:11
   });
 
   const onSuccess = (restaurant) => {
-    toast(`New restaurant Created - id: ${restaurant.id} name: ${restaurant.name}`);
+    toast(``);
   }
 
killedBy: RestaurantCreatePage tests on submit, makes request to backend, and redirects to /restaurants
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New restaurant Created - id: 3 name: South Coast Deli"
Received: ""

Number of calls: 1
