[Killed] ObjectLiteral
main/pages/Restaurants/RestaurantEditPage.js:15:13
         useBackend(
             // Stryker disable next-line all : don't test internal caching of React Query
             [`/api/restaurants?id=${id}`],
-            {  // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-                method: "GET",
-                url: `/api/restaurants`,
-                params: {
-                    id
-                }
-            }
+            {}
         );
 
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RestaurantForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/pages/Restaurants/RestaurantEditPage.js:17:22
             [`/api/restaurants?id=${id}`],
             {  // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
                 method: "GET",
-                url: `/api/restaurants`,
+                url: ``,
                 params: {
                     id
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RestaurantForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/Restaurants/RestaurantEditPage.js:24:36
             }
         );
 
-    const objectToAxiosPutParams = (restaurant) => ({
-        url: "/api/restaurants",
-        method: "PUT",
-        params: {
-            id: restaurant.id,
-        },
-        data: {
-            name: restaurant.name,
-            description: restaurant.description,
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (restaurant) => {
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Restaurant Updated - id: 17 name: Freebirds World Burrito"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/Restaurants/RestaurantEditPage.js:24:53
             }
         );
 
-    const objectToAxiosPutParams = (restaurant) => ({
-        url: "/api/restaurants",
-        method: "PUT",
-        params: {
-            id: restaurant.id,
-        },
-        data: {
-            name: restaurant.name,
-            description: restaurant.description,
-        }
-    });
+    const objectToAxiosPutParams = (restaurant) => ({});
 
     const onSuccess = (restaurant) => {
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Restaurant Updated - id: 17 name: Freebirds World Burrito"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/Restaurants/RestaurantEditPage.js:36:39
         }
     });
 
-    const onSuccess = (restaurant) => {
-        toast(`Restaurant Updated - id: ${restaurant.id} name: ${restaurant.name}`);
-    }
+    const onSuccess = (restaurant) => {}
 
     const mutation = useBackendMutation(
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/Restaurants/RestaurantEditPage.js:53:34
         mutation.mutate(data);
     }
 
-    if (isSuccess && !storybook) {
-        return <Navigate to="/restaurants" />
-    }
+    if (isSuccess && !storybook) {}
 
     return (
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/restaurants"}

Number of calls: 0

[Killed] ConditionalExpression
main/pages/Restaurants/RestaurantEditPage.js:62:21
             <div className="pt-2">
                 <h1>Edit Restaurant</h1>
                 {
-                    restaurant && <RestaurantForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={restaurant} />
+                    true
                 }
             </div>
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RestaurantForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/Restaurants/RestaurantEditPage.js:62:21
             <div className="pt-2">
                 <h1>Edit Restaurant</h1>
                 {
-                    restaurant && <RestaurantForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={restaurant} />
+                    restaurant || <RestaurantForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={restaurant} />
                 }
             </div>
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, name, description}). If you meant to render a collection of children, use an array instead.
