[Killed] StringLiteral
main/pages/Restaurants/RestaurantIndexPage.js:17:35
         useBackend(
             // Stryker disable next-line all : don't test internal caching of React Query
             ["/api/restaurants/all"],
-            { method: "GET", url: "/api/restaurants/all" },
+            { method: "GET", url: "" },
             // Stryker disable next-line all : don't test default value of empty list
             []
killedBy: RestaurantIndexPage tests renders three restaurants correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="RestaurantTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/pages/Restaurants/RestaurantIndexPage.js:22:32
             []
         );
 
-    const createButton = () => {
-        if (hasRole(currentUser, "ROLE_ADMIN")) {
-            return (
-                <Button
-                    variant="primary"
-                    href="/restaurants/create"
-                    style={{ float: "right" }}
-                >
-                    Create Restaurant
-                </Button>
-            )
-        } 
-    }
+    const createButton = () => {}
 
     return (
killedBy: RestaurantIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Restaurant/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/pages/Restaurants/RestaurantIndexPage.js:23:49
         );
 
     const createButton = () => {
-        if (hasRole(currentUser, "ROLE_ADMIN")) {
-            return (
-                <Button
-                    variant="primary"
-                    href="/restaurants/create"
-                    style={{ float: "right" }}
-                >
-                    Create Restaurant
-                </Button>
-            )
-        } 
+        if (hasRole(currentUser, "ROLE_ADMIN")) {} 
     }
 
killedBy: RestaurantIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Restaurant/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/pages/Restaurants/RestaurantIndexPage.js:28:37
                 <Button
                     variant="primary"
                     href="/restaurants/create"
-                    style={{ float: "right" }}
+                    style={{ float: "" }}
                 >
                     Create Restaurant
killedBy: RestaurantIndexPage tests Renders with Create Button for admin user
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
