[Killed] ConditionalExpression
main/pages/UCSBDates/UCSBDatesEditPage.js:64:11
       <div className="pt-2">
         <h1>Edit UCSBDate</h1>
         {
-          ucsbDate && <UCSBDateForm initialContents={ucsbDate} submitAction={onSubmit} buttonLabel="Update" />
+          false
         }
       </div>
killedBy: UCSBDatesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBDateForm-quarterYYYYQ"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/UCSBDates/UCSBDatesEditPage.js:64:11
       <div className="pt-2">
         <h1>Edit UCSBDate</h1>
         {
-          ucsbDate && <UCSBDateForm initialContents={ucsbDate} submitAction={onSubmit} buttonLabel="Update" />
+          ucsbDate || <UCSBDateForm initialContents={ucsbDate} submitAction={onSubmit} buttonLabel="Update" />
         }
       </div>
killedBy: UCSBDatesEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="UCSBDateForm-quarterYYYYQ" id="quarterYYYYQ" name="quarterYYYYQ" type="text" /> instead
