[Killed] BlockStatement
main/pages/UCSBDates/UCSBDatesIndexPage.js:13:30
 
   const currentUser = useCurrentUser();
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        return (
-            <Button
-                variant="primary"
-                href="/ucsbdates/create"
-                style={{ float: "right" }}
-            >
-                Create UCSBDate 
-            </Button>
-        )
-    } 
-  }
+  const createButton = () => {}
   
   const { data: dates, error: _error, status: _status } =
killedBy: UCSBDatesIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create UCSBDate/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
