[Killed] BlockStatement
src/main/utils/articleUtils.js:8:47
     toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/articles",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.id
-        }
-    }
-}
+export function cellToAxiosParamsDelete(cell) {}
 
 
killedBy: articleUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "DELETE", "params": {"id": 17}, "url": "/api/articles"}
Received: undefined

[Killed] ObjectLiteral
src/main/utils/articleUtils.js:12:17
     return {
         url: "/api/articles",
         method: "DELETE",
-        params: {
-            id: cell.row.values.id
-        }
+        params: {}
     }
 }
killedBy: articleUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

  Object {
    "method": "DELETE",
-   "params": Object {
