[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:39:21
         },
 
         {
-            Header: 'Organization Translation Short',
+            Header: "",
             accessor: 'orgTranslationShort',
         },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Organization Translation Short. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ArrowFunction
main/components/UCSBOrganization/UCSBOrganizationTable.js:49:19
         {
             Header: 'Inactive',
             accessor: 'inactive',
-            Cell: ({ value }) => value ? "Yes" : "No" // This will display 'Yes' for true values and 'No' for false
+            Cell: () => undefined // This will display 'Yes' for true values and 'No' for false
         }
     ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Survived] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:49:50
         {
             Header: 'Inactive',
             accessor: 'inactive',
-            Cell: ({ value }) => value ? "Yes" : "No" // This will display 'Yes' for true values and 'No' for false
+            Cell: ({ value }) => value ? "Yes" : "" // This will display 'Yes' for true values and 'No' for false
         }
     ];
