[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:24:34
     );
 
 
-  const objectToAxiosPutParams = (ucsbOrganization) => ({
-    url: "/api/ucsborganizations",
-    method: "PUT",
-    params: {
-      orgCode: ucsbOrganization.orgCode,
-    },
-    data: {
-      orgCode: ucsbOrganization.orgCode,
-      orgTranslation: ucsbOrganization.orgTranslation,
-      orgTranslationShort: ucsbOrganization.orgTranslationShort,
-      inactive: ucsbOrganization.inactive,
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (ucsbOrganization) => {
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBOrganization Updated - id: testCode name: test 2"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:25:10
 
 
   const objectToAxiosPutParams = (ucsbOrganization) => ({
-    url: "/api/ucsborganizations",
+    url: "",
     method: "PUT",
     params: {
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBOrganization Updated - id: testCode name: test 2"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:38:43
     }
   });
 
-  const onSuccess = (ucsbOrganization) => {
-    console.log("HERE");
-    toast(`UCSBOrganization Updated - id: ${ucsbOrganization.orgCode} name: ${ucsbOrganization.orgTranslation}`);
-  }
+  const onSuccess = (ucsbOrganization) => {}
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:65:11
       <div className="pt-2">
         <h1>Edit UCSBOrganization</h1>
         {
-          ucsbOrganization && <UCSBOrganizationForm initialContents={ucsbOrganization} submitAction={onSubmit} buttonLabel="Update" />
+          false
         }
       </div>
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:65:11
       <div className="pt-2">
         <h1>Edit UCSBOrganization</h1>
         {
-          ucsbOrganization && <UCSBOrganizationForm initialContents={ucsbOrganization} submitAction={onSubmit} buttonLabel="Update" />
+          true
         }
       </div>
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
