[Killed] LogicalOperator
main/components/UCSBOrganization/UCSBOrganizationForm.js:11:26
         formState: { errors },
         handleSubmit,
     } = useForm(
-        { defaultValues: initialContents || {}, }
+        { defaultValues: initialContents && {}, }
     );
 
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(element).toHaveValue(testCode)

Expected the element to have value:
  testCode
Received:

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.js:11:26
         formState: { errors },
         handleSubmit,
     } = useForm(
-        { defaultValues: initialContents || {}, }
+        { defaultValues: false, }
     );
 
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(element).toHaveValue(testCode)

Expected the element to have value:
  testCode
Received:

[Killed] BooleanLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:29:56
                     {...register("orgCode", {
                         required: "Organization Code is required.",
                     })}
-                    disabled={initialContents ? true : false}
+                    disabled={initialContents ? true : true}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Survived] BooleanLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:29:49
                     {...register("orgCode", {
                         required: "Organization Code is required.",
                     })}
-                    disabled={initialContents ? true : false}
+                    disabled={initialContents ? false : false}
                 />
                 <Form.Control.Feedback type="invalid">
