[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:20:43
     }
   });
 
-  const onSuccess = (ucsbOrganization) => {
-    toast(`New UCSBOrganization Created - orgCode: ${ucsbOrganization.orgCode} inactive: ${ucsbOrganization.inactive}`);
-  }
+  const onSuccess = (ucsbOrganization) => {}
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New UCSBOrganization Created - orgCode: 123 inactive: true"

Number of calls: 0

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:21:11
   });
 
   const onSuccess = (ucsbOrganization) => {
-    toast(`New UCSBOrganization Created - orgCode: ${ucsbOrganization.orgCode} inactive: ${ucsbOrganization.inactive}`);
+    toast(``);
   }
 
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New UCSBOrganization Created - orgCode: 123 inactive: true"
Received: ""

Number of calls: 1

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:36:18
     mutation.mutate(data);
   }
 
-  if (isSuccess) {
-    // Redirect to the UCSBOrganization index page after successful creation
-    return <Navigate to="/ucsborganization" />;
-  }
+  if (isSuccess) {}
 
   return (
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/ucsborganization"}

Number of calls: 0
