[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:91:43
                             type="text"
                             isInvalid={Boolean(errors.tableOrBreakoutRoom)}
                             {...register("tableOrBreakoutRoom", {
-                                required: "tableOrBreakoutRoom is required."
+                                required: ""
                             })}
                         />
killedBy: HelpRequestForm tests Correct Error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /tableOrBreakoutRoom is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:108:57
                             id="explanation"
                             type="text"
                             isInvalid={Boolean(errors.explanation)}
-                            {...register("explanation", {
-                                required: "explanation is required."
-                            })}
+                            {...register("explanation", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /explanation is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:127:64
                             data-testid="HelpRequestForm-solved"
                             id="solved"
                             isInvalid={Boolean(errors.solved)}
-                            {...register("solved", { required: "This field is required." })}
+                            {...register("solved", { required: "" })}
                         >
                             <option value="">-- Select an option --</option>
killedBy: HelpRequestForm tests Correct Error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /This field is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
