[Killed] BlockStatement
main/components/HelpRequest/HelpRequestTable.js:13:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/helprequest/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/helprequest/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:14:18
     const navigate = useNavigate();
 
     const editCallback = (cell) => {
-        navigate(`/helprequest/edit/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/helprequest/edit/2"
Received: ""

Number of calls: 1

<html>

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:48:21
             accessor: 'requestTime',
         },
         {
-            Header: 'Table or Breakout Room',
+            Header: "",
             accessor: 'tableOrBreakoutRoom',
         },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Table or Breakout Room. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:49:23
         },
         {
             Header: 'Table or Breakout Room',
-            accessor: 'tableOrBreakoutRoom',
+            accessor: "",
         },
         {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-tableOrBreakoutRoom"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:53:23
         },
         {
             Header: 'Team ID',
-            accessor: 'teamId',
+            accessor: "",
         },
         {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-teamId"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
