[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:28:14
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
 
-            {initialContents && (
-                <Form.Group className="mb-3" >
-                    <Form.Label htmlFor="id">Id</Form.Label>
-                    <Form.Control
-                        data-testid="MenuItemReviewForm-id"
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {false}
 
             <Form.Group className="mb-3" >
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:90:22
                 <Form.Control.Feedback type="invalid">
                     {errors.stars?.message}
                     {(errors.stars?.type === 'min') && 'Minimum rating of 1 star'}
-                    {(errors.stars?.type === 'max') && 'Maximum rating of 5 stars'}
+                    {false}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on stars greater than 5
statusReason: Error: Unable to find an element with the text: /Maximum rating of 5 stars/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:90:22
                 <Form.Control.Feedback type="invalid">
                     {errors.stars?.message}
                     {(errors.stars?.type === 'min') && 'Minimum rating of 1 star'}
-                    {(errors.stars?.type === 'max') && 'Maximum rating of 5 stars'}
+                    {true}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on stars greater than 5
statusReason: Error: Unable to find an element with the text: /Maximum rating of 5 stars/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
