[Killed] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewCreatePage.js:9:31
 
 export default function UCSBDatesCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (menuItemReview) => ({
-    url: "/api/menuitemreview/post",
-    method: "POST",
-    params: {
-      itemId: menuItemReview.itemId,
-      reviewerEmail: menuItemReview.reviewerEmail,
-      stars: menuItemReview.stars,
-      dateReviewed: menuItemReview.dateReviewed,
-      comments: menuItemReview.comments,
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (menuItemReview) => {
killedBy: MenuItemReviewCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
