[Killed] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewEditPage.js:25:34
     );
 
 
-  const objectToAxiosPutParams = (menuItemReview) => ({
-    url: "/api/menuitemreview",
-    method: "PUT",
-    params: {
-      id: menuItemReview.id,
-    },
-    data: {
-      itemId: menuItemReview.itemId,
-      reviewerEmail: menuItemReview.reviewerEmail,
-      stars: menuItemReview.stars,
-      dateReviewed: menuItemReview.dateReviewed,
-      comments: menuItemReview.comments,
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (menuItemReview) => {
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Menu Item Review Updated - id: 17 itemId: 8 reviewerEmail: wesley@lame.edu dateReviewed: 2022-01-02T00:00 stars: 1 comments: boobooboo"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2
