[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:46:55
                     id="diningCommonsCode"
                     type="text"
                     isInvalid={Boolean(errors.diningCommonsCode)}
-                    {...register("diningCommonsCode", {
-                        required: "Dining Commons Code is required.",
-                        maxLength : {
-                            value: 30,
-                            message: "Max length 30 characters"
-                        }
-                    })}
+                    {...register("diningCommonsCode", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItem tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Dining Commons Code is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:66:42
                     id="name"
                     type="text"
                     isInvalid={Boolean(errors.name)}
-                    {...register("name", {
-                        required: "Name is required.",
-                        maxLength: {
-                            value: 30,
-                            message: "Max length 30 characters"
-                        }
-                    })}
+                    {...register("name", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItem tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Name is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:68:36
                     isInvalid={Boolean(errors.name)}
                     {...register("name", {
                         required: "Name is required.",
-                        maxLength: {
-                            value: 30,
-                            message: "Max length 30 characters"
-                        }
+                        maxLength: {}
                     })}
                 />
killedBy: UCSBDiningCommonsMenuItem tests that the correct validations are performed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 2

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:89:36
                     isInvalid={Boolean(errors.station)}
                     {...register("station", {
                         required: "Station is required.",
-                        maxLength: {
-                            value: 30,
-                            message: "Max length 30 characters"
-                        }
+                        maxLength: {}
                     })}
                 />
killedBy: UCSBDiningCommonsMenuItem tests that the correct validations are performed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 2

<html>
  <head />
  <body>
