[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:12:20
 export default function UCSBDiningCommonsMenuItemTable({
     ucsbDiningCommonsMenuItem,
     currentUser,
-    testIdPrefix = "DiningCommonsMenuItemTable" }) {
+    testIdPrefix = "" }) {
 
     const navigate = useNavigate();
killedBy: UCSBDiningCommonsMenuItemIndexPage tests renders three ucsb dining commons menu items correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="DiningCommonsMenuItemTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
