[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:9:31
 
 export default function UCSBDiningCommonsMenuItemCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (ucsbdiningcommonsmenuitem) => ({
-    url: "/api/ucsbdiningcommonsmenuitems/post",
-    method: "POST",
-    params: {
-      diningCommonsCode: ucsbdiningcommonsmenuitem.diningCommonsCode,
-     name: ucsbdiningcommonsmenuitem.name,
-     station: ucsbdiningcommonsmenuitem.station
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ucsbdiningcommonsmenuitem) => {
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /diningcommonsmenuitem
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:12:13
   const objectToAxiosParams = (ucsbdiningcommonsmenuitem) => ({
     url: "/api/ucsbdiningcommonsmenuitems/post",
     method: "POST",
-    params: {
-      diningCommonsCode: ucsbdiningcommonsmenuitem.diningCommonsCode,
-     name: ucsbdiningcommonsmenuitem.name,
-     station: ucsbdiningcommonsmenuitem.station
-    }
+    params: {}
   });
 
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /diningcommonsmenuitem
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Object {
-   "diningCommonsCode": "De La Guerra",
-   "name": "Fried Tacos",

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:19:52
     }
   });
 
-  const onSuccess = (ucsbdiningcommonsmenuitem) => {
-    toast(`New UCSB Dining Commons Menu Item Created - id: ${ucsbdiningcommonsmenuitem.id} name: ${ucsbdiningcommonsmenuitem.name}`);
-  }
+  const onSuccess = (ucsbdiningcommonsmenuitem) => {}
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /diningcommonsmenuitem
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New UCSB Dining Commons Menu Item Created - id: 4 name: Fried Tacos"

Number of calls: 0
