[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:15:13
         useBackend(
             // Stryker disable next-line all : don't test internal caching of React Query
             [`/api/UCSBDiningCommonsMenuItem?id=${id}`],
-            {  // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-                method: "GET",
-                url: `/api/ucsbdiningcommonsmenuitems`,
-                params: {
-                    id
-                }
-            }
+            {}
         );
 
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="DiningCommonsMenuItemForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:24:36
             }
         );
 
-    const objectToAxiosPutParams = (ucsbdiningcommonsmenuitem) => ({
-        url: "/api/ucsbdiningcommonsmenuitems",
-        method: "PUT",
-        params: {
-            id: ucsbdiningcommonsmenuitem.id,
-        },
-        data: {
-          diningCommonsCode: ucsbdiningcommonsmenuitem.diningCommonsCode,
-          name: ucsbdiningcommonsmenuitem.name,
-          station: ucsbdiningcommonsmenuitem.station,
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (ucsbdiningcommonsmenuitem) => {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSB Dining Commons Menu Item Updated - id: 17 name: Spicy Tuna Handroll"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:24:68
             }
         );
 
-    const objectToAxiosPutParams = (ucsbdiningcommonsmenuitem) => ({
-        url: "/api/ucsbdiningcommonsmenuitems",
-        method: "PUT",
-        params: {
-            id: ucsbdiningcommonsmenuitem.id,
-        },
-        data: {
-          diningCommonsCode: ucsbdiningcommonsmenuitem.diningCommonsCode,
-          name: ucsbdiningcommonsmenuitem.name,
-          station: ucsbdiningcommonsmenuitem.station,
-        }
-    });
+    const objectToAxiosPutParams = (ucsbdiningcommonsmenuitem) => ({});
 
     const onSuccess = (ucsbdiningcommonsmenuitem) => {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSB Dining Commons Menu Item Updated - id: 17 name: Spicy Tuna Handroll"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:27:17
     const objectToAxiosPutParams = (ucsbdiningcommonsmenuitem) => ({
         url: "/api/ucsbdiningcommonsmenuitems",
         method: "PUT",
-        params: {
-            id: ucsbdiningcommonsmenuitem.id,
-        },
+        params: {},
         data: {
           diningCommonsCode: ucsbdiningcommonsmenuitem.diningCommonsCode,
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "id": 17,
- }

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:37:54
         }
     });
 
-    const onSuccess = (ucsbdiningcommonsmenuitem) => {
-        toast(`UCSB Dining Commons Menu Item Updated - id: ${ucsbdiningcommonsmenuitem.id} name: ${ucsbdiningcommonsmenuitem.name}`);
-    }
+    const onSuccess = (ucsbdiningcommonsmenuitem) => {}
 
     const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:63:21
             <div className="pt-2">
                 <h1>Edit UCSB Dining Commons Menu Item</h1>
                 {
-                    ucsbdiningcommonsmenuitem && <UCSBDiningCommonsMenuItemForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={ucsbdiningcommonsmenuitem} />
+                    false
                 }
             </div>
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="DiningCommonsMenuItemForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:63:21
             <div className="pt-2">
                 <h1>Edit UCSB Dining Commons Menu Item</h1>
                 {
-                    ucsbdiningcommonsmenuitem && <UCSBDiningCommonsMenuItemForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={ucsbdiningcommonsmenuitem} />
+                    ucsbdiningcommonsmenuitem || <UCSBDiningCommonsMenuItemForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={ucsbdiningcommonsmenuitem} />
                 }
             </div>
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, diningCommonsCode, name, station}). If you meant to render a collection of children, use an array instead.
